tutorials/NH3decompostion.threeBalls/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 700; 


boundaryField
{
    catalyticWalls
    {
        type            heatFluxFromCatalyticSurfaces;
        gradient        uniform 0.0;
        value           $internalField;            
    }
    wall
    {
        type            fixedValue;
        value           uniform 873;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 700;
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
