tutorials/NH3decompostion.threeBalls/constant/catalystThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      catalystThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidThermoType
{
    solidType            hePsiCatThermo;
    solidMixture         multiComponentCatMixture;
    solidTransport       const;
    solidThermo          hConst;
    solidEnergy          sensibleEnthalpy;
    solidEquationOfState rhoConst;
    solidSpecie          specie;
}

inertSpecie N2;

#include "thermo.catalyst.solid.const"

// ************************************************************************* //
