tutorials/NH3decompostion.threeBalls/constant/surfaceChemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfaceChemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// identify using particle-resolved model or porous media
onlySurfaceCatalyst true; //-default value is "false"

catalystRegions
{
    catalyticSurfaces     (catalyticWalls);
    catalyticZones        ( );  // turn-on if don't use
}

catalystToGeometricAreaRatio    1.0; //Fcat/geo, default is 1.0
effectivenessFactor             1.0; //eta, default is 1.0


surfaceChemistryType
{
    solver          odeSCHEM;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

odeSCHEMCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          0.01;
}

//#include "reactions.surf"
#include "reactions.surf.Takahashi"

// ************************************************************************* //
