tutorials/NH3decompostion.threeBalls/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001; //in mm

//block1
x0  -3;
x1   3;
y0  -3;
y1   3;
z0  -1;
z1   9;

// mesh size 0.5 mm
//nEx   12;
//nEy   12;
//nEz   20;

// mesh size 0.25 mm
nEx   48;
nEy   48;
nEz   80;

vertices
(
    ( $x0 $y0 $z0 )  //0
    ( $x1 $y0 $z0 )  //1
    ( $x1 $y1 $z0 )  //2
    ( $x0 $y1 $z0 )  //3

    ( $x0 $y0 $z1 )  //4
    ( $x1 $y0 $z1 )  //5
    ( $x1 $y1 $z1 )  //6
    ( $x0 $y1 $z1 )  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nEx $nEy $nEz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);

// ************************************************************************* //
