tutorials/NH3decompostion.threeBalls/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     catalystFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
//stopAt          writeNow;

//endTime         1.2;
endTime         10000;

//deltaT          1e-6;
deltaT          1;

writeControl    adjustableRunTime;

//writeInterval   0.05;
writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

//writePrecision  6;
writePrecision  14; //only for snappyHexMesh

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
   outletAverageNH3
   {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

        writeControl    timeStep;
        writeInterval   500;
        writeFields     false;
        log             true;

        region          region0;
        regionType      patch;
        name            outlet;
        operation       areaAverage;

        fields
        (
            NH3
        );
    }
}


// ************************************************************************* //
